import discord
import asyncio
import functools
import itertools
import math
import datetime
import time
import json
import logging
from discord.enums import VoiceRegion
import json
import random
import os
import re
import platform
import logging
from discord import activity
from discord.channel import VocalGuildChannel, VoiceChannel
from discord import activity
from types import ModuleType
from discord.ext import commands
from discord.ext.commands.errors import NoEntryPointError
from discord import Embed, Emoji
from collections import namedtuple
from typing import Text, ValuesView
from discord import Game
from discord import member
from discord import message
from discord.client import Client
from discord.ext import commands, tasks
from discord.ext import commands
from discord.role import RoleTags
from discord.utils import get
from os import name, system
from itertools import cycle
from asyncio import sleep

from discord.ext import commands
from discord.ext.commands import Bot, bot
from async_timeout import timeout
#=================================================================================================================================================================
#=================================================================================================================================================================
#=================================================================================================================================================================
#=================================================================================================================================================================
#=================================================================================================================================================================
intents = discord.Intents.default()
intents.members = True

client = commands.Bot(command_prefix='!', intents=intents)
client.remove_command("help")



@client.event
async def on_ready():
    await client.change_presence(activity=discord.Activity(type=discord.ActivityType.playing, name='Act Roleplay'))
    print('Bot is ready! {0.user}'.format(client))
    
#=================================================================================================================================================================
#=================================================================================================================================================================

#=================================================================================================================================================================
#donate command
#=================================================================================================================================================================
# @client.command()
# async def donate(ctx, amount=1):
#     await ctx.channel.purge(limit=1)
#     await ctx.send(ctx.author.mention + " Σύντομα ένας <@&889007420251193374> θα σας εξυπηρετήσει")
#=================================================================================================================================================================
#discord link command
#=================================================================================================================================================================
@client.command()
async def link(ctx, ammount=1):
    await ctx.channel.purge(limit=1)
    await ctx.send("```Το Official Link του server είναι:```")
    await ctx.send("https://discord.gg/2sMbeHZN7E")
#=================================================================================================================================================================
# whitelist command
#=================================================================================================================================================================
# @client.command()
# async def whitelist(ctx, amount=1):
#     await ctx.channel.purge(limit=1)
#     await ctx.send(ctx.author.mention + " Σύντομα ένας <@&961657173551747174> θα σας εξυπηρετήσει.")
#=================================================================================================================================================================
# support command
#=================================================================================================================================================================
@client.command()
async def support(ctx, amount=1):
    await ctx.channel.purge(limit=1)
    await ctx.send(ctx.author.mention + " Σύντομα ένα <@&888261562069037076> θα σας εξυπηρετήσει.")
#=================================================================================================================================================================
# lock unlock command
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def lock(ctx):
    await ctx.channel.set_permissions(ctx.guild.default_role, send_messages=False)
    await ctx.send("```🔒 This channel is now locked. 🔒```")


@client.command()
@commands.has_permissions(manage_channels=True)
async def unlock(ctx):
    await ctx.channel.set_permissions(ctx.guild.default_role, send_messages=True)
    await ctx.send("```🔓 This channel is now unlocked. 🔓```")
# End
#=================================================================================================================================================================
# kick command
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(kick_members=True)
async def kick(ctx, member: discord.Member, *, reason=None, ammount=1):
    channel2 = client.get_channel(899269598065610792)
    await ctx.channel.purge(limit=1)
    await member.kick(reason=reason)
    await member.kick()
    await channel2.send('O <@&895686196313866280> ' + ctx.author.mention + f", Εκανε Kick τον χρήστη {member.mention} Για τον λόγω: " + reason)
    await ctx.send(f"{member.mention} Was Kicked from the server: Απο το Staff " + ctx.author.mention)
#=================================================================================================================================================================
# ban command
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(ban_members=True)
async def ban(ctx, member: discord.Member, *, reason=None, ammount=1):
    channel2 = client.get_channel(889608023125925919)
    await ctx.channel.purge(limit=1)
    await member.ban(reason=reason)
    await member.ban()
    await channel2.send('O <@&895686196313866280> ' + ctx.author.mention + f", Εβαλε Ban στο χρήστη {member.mention} Για τον λόγω: " + reason)
    await ctx.send(f"{member.mention} Was Banned from the server: Απο το Staff " + ctx.author.mention)
#=================================================================================================================================================================
# mute
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_messages=True)
async def mute(ctx, member: discord.Member, *, reason=None, ammount=1):
    channel2 = client.get_channel(888205980905635841)
    await ctx.channel.purge(limit=1)
    muteRole = discord.utils.get(ctx.guild.roles, name="Muted")
    await member.add_roles(muteRole)
    await  channel2.send('O <@&895686196313866280> ' + ctx.author.mention + f", Εβαλε Mute στο χρήστη {member.mention} Για τον λόγω: " + reason)
    await ctx.send(f"{member.mention} Εχεις Mute Απο το Staff " + ctx.author.mention)
#=================================================================================================================================================================
# clear command
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_messages=True)
async def clear(ctx, amount=5):
    await ctx.channel.send(f'``` Clearing {amount} Messages ```', delete_after=3)
    await ctx.channel.purge(limit=amount)
#=================================================================================================================================================================
#WARN COMMAND
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_messages=True)
async def warn(ctx, member: discord.Member, *, reason=None, ammount=1):
    channel2 = client.get_channel(899262975758725190)
    await ctx.channel.purge(limit=1)
    warnRole = discord.utils.get(ctx.guild.roles, name="Warning")
    await member.add_roles(warnRole)
    await  channel2.send('O <@&895686196313866280> ' + ctx.author.mention + f", Εβαλε Warn στο χρήστη {member.mention} Για τον λόγω: " + reason)
    await ctx.send(f"{member.mention} Εχεις Warn Για τον λόγω: " + reason)
#=================================================================================================================================================================
# up command
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def up(ctx, amount=1):
    await ctx.channel.purge(limit=1)
    embed = discord.Embed(
        title="𝐒𝐞𝐫𝐯𝐞𝐫 𝐈𝐬 𝐔𝐩 ", description='▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂', color=0x7CFC00)
    embed.add_field(name='```ᴄᴏɴɴᴇᴄᴛ ɪᴘ  -->  connect 45.145.227.42:30200                          ```',
                    value='▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂', inline=True)
    embed.set_image(
        url="https://cdn.discordapp.com/attachments/841081967688941578/894335885657640970/350kb_2.gif")
    await ctx.send(embed=embed)
    await ctx.send('||@everyone ||')
#=================================================================================================================================================================
# ip command
#=================================================================================================================================================================
@client.command()
async def ip(ctx):
    embed = discord.Embed(
        title="<:actroleplay:889817678053781564> ᴄᴏɴɴᴇᴄᴛ ɪᴘ --> connect 45.145.227.42:30200 <:actroleplay:889817678053781564>", color=0xB22222)
    embed.set_image(
        url="https://cdn.discordapp.com/attachments/889148588242923590/890961090463277067/21312312.gif")
    await ctx.send(embed=embed)

@client.command()
@commands.has_permissions(manage_channels=True)
async def conn(ctx):
    desc ="""
    `CONNECT TO ACT ROLEPLAY`

    > Βήμα 1: Ανοίγεται το FiveM
    
    > Βήμα 2: Πατάτε το κουμπί "F8"

    > Βήμα 3: Γράφετε αυτό --> connect 45.145.227.42:30200

    """
    embed = discord.Embed(description = desc, color=0x4682B4)
    await ctx.send(embed = embed)

#=================================================================================================================================================================
# restart plan command
#=================================================================================================================================================================
@client.command()
async def rr(ctx):
    embed = discord.Embed(title="⏰Ώρες που ο server κάνει Restart⏰",
                          description="1:00-5:00-13:00-17:00", color=0xB22222)
    embed.set_thumbnail(
        url="https://cdn.discordapp.com/attachments/889148588242923590/890961090463277067/21312312.gif")
    embed.set_footer(text="Restart Plan Of Act RolePlay")
    await ctx.send(embed=embed)
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def app(ctx):
    embed = discord.Embed(title="_Click Here For ΕΛ.ΑΣ Application_",
                          url='https://docs.google.com/forms/d/e/1FAIpQLScMrtYjLy-67l1u_5cmE07e5njsEopdle-qZVKwxWVFpTF_9g/viewform', color=0x0000FF)
    embed.set_author(
        name='Για να κάνετε αίτηση στην Ελληνική Αστυνομία πατήστε στον παρακάτω συνδεσμο:')
    embed.set_footer(text=" ΕΛ.ΑΣ Application")
    await ctx.send(embed=embed)

    embed = discord.Embed(title='_Click Here For Ε.Κ.Α.Β Application_',
                          url='https://docs.google.com/forms/d/e/1FAIpQLSdEhY4oMmd6U0aDReb39cmPEqzk5YBZ0cet0ybTPGdQWun3Rw/viewform',  color=0x228B22)
    embed.set_author(
        name='Για να κάνετε αίτηση στo Ε.Κ.Α.Β πατήστε στον παρακάτω συνδεσμο:')
    embed.set_footer(text='Ε.Κ.Α.Β Application')
    await ctx.send(embed=embed)
#=================================================================================================================================================================
#██████╗░██╗░░░██╗██╗░░░░░███████╗░██████╗
#██╔══██╗██║░░░██║██║░░░░░██╔════╝██╔════╝
#██████╔╝██║░░░██║██║░░░░░█████╗░░╚█████╗░
#██╔══██╗██║░░░██║██║░░░░░██╔══╝░░░╚═══██╗
#██║░░██║╚██████╔╝███████╗███████╗██████╔╝
#╚═╝░░╚═╝░╚═════╝░╚══════╝╚══════╝╚═════╝░
#=================================================================================================================================================================
# GLOBAL
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def globrul(ctx):


    desc ="""
    > RDM/Random Death: Είναι όταν κάποιος σε σκοτώσει δίχως να έχει προηγηθεί κάποιο roleplay.

    > VDM/Vehicle Deathmatch: Είναι όταν κάποιος προσπαθεί να σκοτώσει ή να χτυπήσει κάποιον με όχημα  εσκεμμένα.

    > Power Gaming: Είναι όταν κάποιος χρησιμοποιεί τη μηχανική του παιχνιδιού για να κάνει κάτι μη ρεαλιστικό και να αποκτήσει πλεονέκτημα σε οποιοδήποτε σκηνικό.  Για παράδειγμα να τρακάρεις με μεγάλη ταχύτητα και να  συνεχίσεις  σαν να μην συνέβη τίποτα. (edited)

    > Meta Gaming: Είναι όταν κάποιος γνωρίζει  και χρησιμοποιεί πληροφορίες που δεν γνωρίζει ο χαρακτήρας του in game. (edited)

    > Combat Log: Είναι όταν κάποιος αποχωρήσει  από τον server ενώ βρίσκεται σε ένα σκηνικό είτε ζωντανός είτε νεκρός.

    > Call Bait: Είναι όταν κάποιος καλέσει κάποια υπηρεσία με σκοπό να τους κλέψει

    > Cop Bait: Όταν κάποιος προκαλεί την αστυνομία εσκεμμένα να τον καταδιώξει.

    > NLR/New Life Rule: Όταν κάποιος πεθάνει και ξυπνήσει στο Ε.Κ.Α.Β. δεν θυμάται τίποτα από τα τελευταία γεγονότα. Το NLR παύει να ισχύει αν κάποιος από το σκηνικό δεν είχε πεθάνει και σου θυμίσει το γεγονός.

    > VOL/Value Of Life: Όταν κάποιος παίρνει αποφάσεις υπολογίζοντας τη ζωή του σαν μία και μοναδική. Οπότε θα πρέπει  οι επιλογές σας να βασίζονται στην επιβίωση του χαρακτήρα σας ή κάποιου δικού σας γνωστού (edited)

    > BM/Bad Manner: Είναι όταν κάποιος θίξει την προσωπικότητα κάποιου άλλου παίκτη. Είτε αυτό γίνει λεκτικά, είτε αυτό γίνει μέσω μηνυμάτων, είτε αυτό γίνει με την οποιαδήποτε μηχανική in-game

    > OOC/Out Of Character: Όταν κάποιος βγαίνει εκτός χαρακτήρα και μιλάει σαν να παίζει παιχνίδι.


        """
    embed = discord.Embed(description = desc,title='```                           GLOBAL RULES                         ```',color=0x4682B4)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# GENERAL
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def genrul(ctx):

    
    desc ="""
    > 1.Απαγορεύεται η άρνηση R.P. δηλαδή να σας μιλάει κάποιος και εσείς να μην μιλάτε, να σας λέει να κάνετε κάτι και εσείς να μην το κάνετε, με σκοπό να αποφύγετε συμμετέχετε σε οποιδήποτε σκηνικό.

    > 2.Απαγορεύεται οποιοσδήποτε τύπος κράνους που προσφέρει παραπάνω αντοχή, εκτός του κράνους μηχανής (όταν οδηγάτε μηχανή). [Είστε υποχρεωμένοι όταν κατέβετε από την μηχανή, να βγάλετε το κράνος]. Εξαιρείται η αστυνομία.

    > 3.Απαγορεύεται το camp σε bush , απαγορεύεται τελειώς να βρίσκεσαι σε έναν θάμνο εν ώρα fight. Απαγορεύεται το camp έξω από green zone.

    > 4.Απαγορεύεται να κλέψεις περιπολικό ή ασθενοφόρο χωρίς να έχει προηγιθεί κάποιο R.P. που να σας δικαιλογεί.

    > 5.Απαγορεύεται αυστηρά το scam. Δηλαδή να σου κάνει κάποιος μεταβίβαση και να μην του δώσεις τα χρήματα και το αντίστροφο.

    > 6.Οποιδήποτε JOB απαγορεύεται να έχει πάνω από 20 άτομα

    > 7.Απαγορεύεται αυστηρά η οποιαδήποτε unofficial οργάνωση ( Mafia, Gang, Cartel ).

    > 8.Απαγορεύεται αυστηρά η αγορά - πώληση οποιουδήποτε DONATE CAR/JOB.

    > 9.Σε περίπτωση που κάποιο civilian job καεί απο καποια ομάδα criminal μένει κλειστό για 24 ώρες. Αν το κλείσει η αστυνομία μενεί για 12 ώρες κλειστό.(Οταν το κατάστημα είναι κλειστό  όλοι off duty)


    """
    embed = discord.Embed(description = desc,title='```                           GENERAL RULES                         ```',color=0x99411d)
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# ZONES RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def gzones(ctx):

    
    desc ="""
    > 1.Όλα τα Garage

    > 2.To Car Dealer

    > 3.Η σχολή οδηγών

    > 4.Όλα τα συνεργεία [μέσα μόνο]

    > 5.Όλα τα σημεία εργασίας και πώλησης του Ο.Α.Ε.Δ.

    > 6.Το Job Center και όλο το τετράγωνο γύρο του

    > 7.Το Ε.Κ.Α.Β. [μέσα - έξω]

    > 8.Οι φυλακές [μέσα - έξω] [ΔΕΝ ΣΠΑΝΕ ΠΟΤΕ]

    > 9.Τo αστυνομικό τμήμα [μέσα - έξω] [ΔΕΝ ΣΠΑΕΙ ΠΟΤΕ]

    """
    embed = discord.Embed(description = desc,title='```                          GREEN ZONE                         ```',color=0x0BDA51)
        
    await ctx.send(embed = embed)

@client.command()
@commands.has_permissions(manage_channels=True)
async def rzones(ctx):
    desc ="""
        **Στα παρακάτω red zones ισχύει το KOS/Kill On Sight:** 
        ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂      

        > 1.Όλα τα Drug Fields (χωράφια ναρκωτικών)
        
        > 2.Όλα τα Procces (περιοχές επεξεργασίας ναρκωτικών)
        
        > 3.Ο Drug Dealer
        
        > 4.To Black Market
        
        > 5.Όλα τα Hoods [Μέσα στα σπίτια]
        
        > 6.Oλες οι βίλες από Μαφίες και Καρτέλ [Μέσα στις βίλες]
   
    """

    embed = discord.Embed(description = desc,title='```                           RED ZONE                         ```',color=0xb22222)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# ROB RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def robrul(ctx):

    
    desc ="""
        > 1.Ο ελάχιστος αριθμός ληστών είναι 2 άτομα και τουλάχιστον 1 όμηρος.

        > 2.Απαγορεύεται να κάνετε κάποια ληστεία-ομηρία με στημένο όμηρο.

        > 3.Απαγορεύεται νε ξεκινήσετε κάποια ληστεία (ομηρία) ενώ υπάρχάει ήδη κποια ληστεία (ομηρία) σε εξέλιξη.

        > 4.Απαγορεύεται η χρήση οποιουδήποτε DONATE CAR.

        > 5.Για να ξεκινίσετε ληστεία σε κάποια τράπεζα πρέπει να υπάρχουν τουλάχιστον 5 αστυνομικοί ON DUTY.

        > 6.Οι αστυνομικοί σε οποιοδήποτε σκηνικό ληστείας πρέπει να είναι +3 από τους ληστές (μαζί με τον διαπραγματευτή).

        > 7.Είστε υποχρεομένοι να αναφέρετε πόσα άτομα εμπλέκονται στο σκηνικό [Εσωτερκούς-Εξωτερικούς].

        > 8.Απαγορεύεται να φύγεται από την τράπεζα εάν η αστυνομία δεν έρθει εντός 15 λεπτών.

        > 9.Το ελάχιστο όριο αιτημάτων ειναι (3). Αλλά από 3 ομήρους και πάνω έχετε +1 αίτημα ανά κεφάλι.

        > 10.Η αστυνομία έχει δικαίωμα να σας απορίψει ένα απο τα αιτήματα σας, παρόλο αυτά μπορεί να σας τα κάνει όλα θετικά εφόσον το ΚΕΝΤΡΟ το εγκρίνει.

        > 11.Από την στιγμή που ξεκινίσει η καταδίωξη με την αστυνομία, έχετε 15 λεπτά ελάχιστο χρόνο για να αλάξετε ρούχα ή να μπείτε σε κάποιο property.

        > 12.Η αστυνομία έχει δικαίωμα να πυροβολίσει τα λάστιχα σας (σε χαμηλές ταχύτητες) μετά από 4 λεπτά καταδίωξης. 

       """
    embed = discord.Embed(description = desc,title='```                           ROBERRY RULES                         ```',color=0xFF0000)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# CRIMINAL RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def crimrul(ctx):

    
    desc ="""
        > 1.Απαγορεύεται οποιαδήποτε εγκληματική ενέργεια εάν δεν υπάρχει παρουσία (2) αστυνομκών και (1) Ε.Κ.Α.Β. στην πόλη.

        > 2.Απαγορεύεται νε ξεκινίσει οποιαδήποτε εγκληματική ενέργεια (μικροκλοπές ή παράνομες αγοραπωλησίες) μέσα σε κάποιο Greenzone.

        > 3.Απαγορεύεται αυστηρά η κλοπή αστυνομικού ή ιατρικού εξοπλισμου [Εκτός από combat pistol, taser].

        > 4.Για να κάνετε απαγωγή κάποιον αστυνομικό, πρέπει να υπάρχουν τουλάχιστον (7) αστυνομικοί και (2) Ε.Κ.Α.Β. ON DUTY

        > 5.Για να κάνετε απαγωγή κάποιον ιατρό, πρέπει να υπάρχουν τουλάχιστον (7) αστυνομικοί και (4) Ε.Κ.Α.Β. ON DUTY

        > 6.Σε οποιδήποτε σκηνικό ομηρίας, ο μέγιστος αριθμός criminals ειναι (15) άτομα, ενώ το ανώτατο όριο από μεριά της αστυνομίας ειναι (20)[Σε οποιδήποτε σκηνικό ομηρίας η αστυνομία μπορεί να είναι ίσοι με τους ληστές (+5) (μαζί με τον διαπραγματευτή)]

        > 7.Μετά από κάποιο Gun Fight σε περίπτωση που τραυματιστείτε θανάσιμα είστε υποχρεωμένοι να τιρήσετε το [ NLR ]. Δεν έχετε δικαίωμα να ξαναπάτε στο σκηνικό. Σε περίπτωση που σας σώσει εκαβίτης είστε υποχρεωμένοι να παίξετε το R.P. του χειρουργείου.[To σκηνικό τελειώνει όταν όλα τα μέλη από μία ομάδα βρεθούν κάτω νεκροί]

        > 8.Απαγορεύεται να σκοτώσεις κάποιον εάν είναι συνεργάσιμος.

    """
    embed = discord.Embed(description = desc,title='```                           CRIMINAL RULES                         ```',color=0x1D3235)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# KILL CHAR RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def killrul(ctx):

    desc ="""
        > 1.Delete character τον εαυτό σου σημαίνει χάνεις τα πάντα [χήματα, inventory, inventory σπιτιού, αυτοκίνητα. Εκτός από (Donate)]
        
        > 2.Από πλευρά Civilian δεν μπορούν να κάνουν kill character κάποιον αλλά μπορούν να κάνουν Delete character τον εαυτό τους.
        
        > 3.Από πλευρά αστυνομίας Delete character που συμαίνει ισόβια και μπορεί να γίνει μόνο μετά από συλογή στοιχείων των εγκληματιών και πληροφοριών για τα άτομα αυτά. Απαραίτητη προυπόθεση είναι να ελέγξει τα στοιχεία κάποιος Εισαγγελέας (Head Admin και πάνω), ο οποίος θα αποφασίσει αν αρκούν για ισόβια.
        
        > 4.Aπό πλευρά Criminal το Kill Character γίνεται μόνο σε Open War και αφού έχεις συλλέξει τα στοιχεία για το αντίπαλο πρόσωπο όπως (ταυτότητα, ομάδα που ανήκει). Πρέπει να τον παρακολούθησεται και να αιχμαλωτιστεί ζωντανός για το τελικό RP.
        
        > 5.Κill character σε αστυνομικό μπορείς να κάνεις αλλά πρέπει να έχεις τα ανάλογα στοιχεία(ταυτότητα, Βαθμό) πρέπει να τον έχεις παρακολουθίσει και να έχεις πολύ σημαντικό λόγο για να γίνει το Kill Character. Επίσης, πρέπει να αιχμαλωτιστεί ζωντανός για το τελικό RP.
        
        > 6.Από τη στιγμή που κάποιος πάρει την απόφαση και μπει σε μία Mαφία,Gang,Kαρτέλ ο αρχηγός μπορεί αναπάσα στιγμή να κάνει Kill Character το άτομο που θα δημιουργήσει πρόβλημα της οργάνωσης κάνοντας το ανάλογο RP.
        
        > 7.Πριν από οποιοδήποτε Kill ή Delete character θα πρέπει να ενημερωθεί κάποιος Head Admin.


    """
    embed = discord.Embed(description = desc,title='```                           KILLCHAR RULES                         ```',color=0x000000)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# MAFIA GANG RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def mafiarul(ctx):

    desc="""
        > 1.Κάθε ομάδα έχει την δυνατότητα να έχει μέχρι ένα σύμαχο, είστε υποχρεωμένοι να το δηλώσετε στο ανάλογο κανάλι. Σε περίπτωση που σπάσετε τη συνεργασία πρέπει και αυτό να δηλωθεί.
        
        > 2.Η οποιαδήποτε criminal ομάδα είναι υποχρεωμένοι να έχει 1 ρουχισμό για το criminal activity, τον οποίο πρέπει να δηλώσει στο Staff Team.
        
        > 3.Σε περίπτωση που θέλετε να ξεκινήσετε κάποιο Open War πρέπει να δηλωθεί στο ανάλογω κανάλι. Στο Open War ισχύει το Kill On Sight (KOS) (εκτός απο Αστυνομικο Τμήμα και το Ε.Κ.Α.Β.) και διαρκεί 3 ημέρες. Αφότου λήξει οι ομάδες αυτομάτως μπαίνουν σε peace time μεταξύ τους που διαρκεί 7 ημέρες. [ Για 7 ημέρες απαγορεύεται και το επιθετικό R.P. μεταξύ σας ] [ Εξαιρούνται τα Red Zones ]
        
        > 4.Από την στιγμή που δηλώσετε Open War είστε και οι δύο μεριές υποχρεωμένοι να φοράτε τον δηλομένο ρουχισμό σας, να κυκλοφορείτε με τα οχήματα του job και απαγορεύεται να αλάξετε ρούχα για το οποιδήποτε σκηνικό μέχρι να τελειώσει το Οpen War.
        
        > 5.Σε οποιδήποτε σενάριο ομηρίας το μέγιστο ποσό είναι : 
            >  ->  10.000 πολίτης
            >  ->  30.000 γιατρός
            >  ->  40.000 αστυνομικός
            >  ->  60.000 διοίκηση ΕΛ.ΑΣ.-Ε.Κ.Α.Β.
            >  ->  20.000 (μαύρα)  απλο μέλος
            >  ->  50.000 (μαύρα) boss
            > Eίστε υποχρεωμένοι να παίξετε το R.P. για να σώσετε τους δικούς σας.
        
        > 6.Απαγορεύεται να βγάλετε 2ο ελικόπτερο για το οποιοδήποτε σκηνικό.
        
        > 7.Απαγορεύεται να μπείτε στη βίλα-σπίτι οποιουδήποτε Criminal Team εάν δεν έχετε δηλωμένο Open War ή εάν δεν έχετε μιλήσει μέσω Αnnon. 

    
    
    
    """
    embed = discord.Embed(description = desc,title='```                     MAFIA-GANG-CARTEL RULES                      ```',color=0x000000)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# STREAMER RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def streamrul(ctx):
    desc="""
    > 1.Για να πάρετε το role <@&888474881073741875>  θα πρέπει να επικοινωνήσετε με  <@&959655623333658705>

    > 2.Το ότι κάνετε stream δεν σας δίνει προβάδισμα σε σχέση με τους υπόλοιπους παίχτες. Το Staff Team θα σας αντιμετωπίζει όπως τους υπόλοιπους παίκτες.

    > 3.Κατά την διάρκεια του Live Stream είστε υποχρεωμένοι να κρύβετε το Postal και τον χάρτη.

    > 4.Απαγορεύεται να δείξετε κάποια κρυφή περιοχή στο Live σας

    > 5.Όταν κάνετε Stream, απαγορεύεται σε κάθε περίπτωση να δυσφημίσετε τον server μας.

    > 6.Σε περίπτωση που έρθει κάποιο staff για κάποιο σκηνικό ή κάποιο report είστε υποχρεωμένοι να κάνετε mute το Stream μέχρι να φύγει το Staff.
    
    
    """
    embed = discord.Embed(description = desc,title='```                           STREAMER RULES                         ```',color=0x9370DB)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# POLICE RULES
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def polrul(ctx):
    desc="""
        1.Απαγορεύονται οι διευθαρμένοι αστυνομικοί.

        2.Απαγορεύεται η αστυνομία να διαβάζει annon chat. 
                                                                           
        3.Απαγορεύεται το camp στις κόκκινες περιοχές.

        4.Η χρήση του taser (πιστόλι ακινητοποιήσης) θα γίνεται μόνο στην περίπτωση που ο εγκληματίας πάει να ξεφύγει και δεν κάνει (VOL).

        5.Η αστυνομία δεν ανοίγει ποτέ πρώτη πυρά εκτός και αν δεχτεί πυρά από την απέναντι ομάδα.

        6.Η αστυνομία μπορεί να κάνει σωματικό έλεγχο μόνο όταν ο πολίτης φωράει μάσκα, οπλοθήκες ή τσάντα.

        7.Απαγορεύεται αυστηρά να δώσετε αστυνομικό εξοπλισμό ή κατασχεμένα αντικείμενα σε άτομα που δεν ανήκουν στο σώμα της ΕΛ.ΑΣ.

        8.Σε μια καταδίωξη η αστυνομία έχει το δικαίωμα να πυροβολήσει στα λάστιχα μετά από 4 λεπτά ή εάν δεχτεί πυρά.

        9.Ο διαπραγματευτής είναι πάντα άοπλος και πηγαίνει στην ληστεία με δικό του υπηρεσιακό όχημα για να παραλάβει τους ομήρους.Δεν συμμετέχει στην καταδίωξη.

        10.Η αστυνομία έχει δικαίωμα να σας κάνει δεκτά τα 2 από τα 3 αίτηματα σε περίπτωση ληστείας-ομηρίας.Παρόλα αυτά μπορεί να σας κάνει και τα 3 δεκτά σε περίπτωση που το Κέντρο το αποφασίσει. 
    
    
    """
    embed = discord.Embed(description = desc,title='```                           POLICE RULES                         ```',color=0x0000FF)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# HOSPITAL RULES  
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def ambrul(ctx):
    desc="""
        1.Όλοι οι γιατροί θα πρέπει να πηγαίνουν στις κλήσεις με τα υπηρεσιακά οχήματα και τα υπηρεσιακά ρούχα.

        2.Απαγορεύεται όταν κάποιος έχει από 10 παλμούς και κάτω, να τον σηκώσετε.(Είναι νεκρός).

        3.Χειρουργείο θα χρειάζονται αυτοί που θα έχουν από 10 εως 20 παλμούς. Σε περίπτωση που δεν υπάρχει χειρούργος on duty, τον σηκώνετε κανονικά.

        4.Aπαγορεύεται αν κάποιος πεθάνει από έκρηξη ή πτώση ελικοπτέρου να τον σηκώσετε

        5.Απαγορεύεται οποιαδήποτε εγκληματική ενέργεια.

        6.Απαγορεύεται να έχετε στην κατοχή σας: ναρκωτικά, όπλα, μαύρα χρήματα.

        7.Όταν είστε εκτός υπηρεσίας είστε υποχρεωμένοι να αλλάζετε τα ρούχα σας, να βάζετε τα υπηρεσιακά οχήματα πίσω στο γκαράζ και να επιστρέψετε όλο τον υπηρεσιακό εξοπλισμό πίσω στις ντουλάπες του Ε.Κ.Α.Β.(Γάζες, Μed Κit)
    
    
    """
    embed = discord.Embed(description = desc,title='```                           EKAV RULES                         ```',color=0x228B22)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# REPORT RULES
#=================================================================================================================================================================

@client.command()
@commands.has_permissions(manage_channels=True)
async def reprul(ctx):
    desc="""
        > 1.Για να κάνετε ένα report για κάποιο σενάριο πρέπει να έχετε τις ανάλογες αποδείξεις (clip).

        > 2.Από κάθε πλευρά θα κάνει μόνο ένα άτομο report.

        > 3.Όταν έρθει το Staff δεν θα μιλάει κανένας μέχρι να σας ζητήσει να μιλίσετε. 

        > 4.Για να πάρετε αντικείμενα ή όπλα πίσω, απο κάποιο fail σκηνικό θα πρέπει να έχετε τις ανάλογες αποδείξεις (clip,screenshot).

        > 5.Σε περίπτωση που δεν έρθει κάποιο staff στο report σας, δεν κάνετε πάλι report, περιμένετε ή πηγαίνετε στο waiting for support στο discord.

        > 6.Απαγορεύονται τα Spam Reports, τα άσκοπα Reports (πχ: ενα tp),τα No Reason Reports. Είστε υποχρεωμένοι όταν κάνετε ένα report να γράφετε και τον λόγο.Σε περίπτωση που παραβλέψετε κάτι απο τα πραπάνω, τo Staff Team έχει το κάθε δικαίωμα να μην έρθει στο report σας καθώς και να σας τιμωρίσει.





    

    """
    embed = discord.Embed(description = desc,title='```                           REPORT RULES                         ```',color=0xBB6A15)
        
    await ctx.send(embed = embed)
#=================================================================================================================================================================
# STAFF RULES
#=================================================================================================================================================================

@client.command()
@commands.has_permissions(manage_channels=True)
async def srul(ctx):
    desc ="""
    `1`📜 Απαγορεύεται να κάνετε R.P. αν υπάρχουν δεν υπάρχουν πάνω από έξι staff in game (Προτεραιώτητα έχει το ανώτερο staff).

    `2`📜 Απαγορεύεται η διαρροή των logs αλλά και η χρήση τους σε περίπτωση που κάνετε R.P.

    `3`📜 Απαγορεύεται η χρήση οποιουδήποτε permission (δικαιώματος) εν ώρα R.P. (Όπως: noclip, steam names, bleeps, κτλ.).

    `4`📜  Έχετε δικαίωμα να αγνοείτε αλλά και να τιμωρείτε Spam Reports καθώς και άσκοπα Reports  (no reason).

    `5`📜 Είστε υποχρεωμένοι να φερθείτε σε όλους τους παίχτες σωστά ακόμα και αν αυτοί δεν το έχουν κάνει. Άσχημη γλώσσα και βρισιές δεν είναι αποδεκτά.

    `6`📜 Είστε υποχρεωμένοι όταν θα κάνετε ban κάποιον παίχτη να αναγράφετε αναλυτικά το reason (τον λόγο) που τον κάνατε ban.

    `7`📜 Σε ένα Report πρέπει να πηγαίνετε με No-Clip και, αφού ελέγξετε την κατάσταση από πάνω, μετά να εμφανίζεστε, αφότου έχετε διασφαλίσει ότι το 
           R.P. έχει τελειώσει ή τουλάχιστον δεν ενοχλείτε σε κάποιο σκηνικό.

    `8`📜 Είστε υποχρεωμένοι όταν είστε On-Duty Staff να κάνετε Moderation όσο δεν υπάρχουν Reports.(πχ. Spectate)

    `9`📜 Είστε υποχρεωμένοι από την στιγμή που βάζετε σκούπες να εξηγείτε τον λόγο για τον οποίο το κάνετε βάση τα rules και έπειτα του κάνετε και 
          [clearloadout αφμ] για να του αφαιρεθούν τα όπλα.
    
    `10`📜 Αποφεύγετε να κάνετε τρία πράγματα:  🔺teleports  🔺revives 🔺repairs Και στις τρεις περιπτώσεις θα τους παροτρίνετε να λύσουν το πρόβλημα 
            τους μέσω R.P.

    `11`📜 Όταν πηγαίνουμε σε ενα report  απαγορεύεται να μιλάμε ή να λήνουμε το σκηνικό από πάνω αόρατοι. Πάντα θα εμφανιζόμαστε για να γνωρίζουν και οι 
            civilιans τα χαρακτηριστικά μας σε περίπτωση που θέλουν να μας κανουν ενα staff report.

    `12`📜 Απαγορεύεται να κάνετε carry κάποιον civilian και να τον κάνετε βόλτες στην πόλη για να τον πάτε σε κάποιο μερος(γκαραζ). Θα πηγαίνετε στο 
             μέρος που θέλετε και θα τον κάνετε bring ή tp player to garaze.

    `13`📜 Σεβόμαστε και ακούμε πάντα τους ανωτέρους μας

    `14`📜 Απαγορεύεται να βγάλετε κάποιο ban που έχει βάλει άλλο staff ανεξερέτου βαθμίδας.

    `15`📜 Όταν θέλουμε να απευθινυούμε σε κάποιον civilian, τον ρωτάμε πάντα με το afm. Ποτέ με το steam name ή το όνομά του.

    `16`📜 Όταν πρέπει να καλέσουμε άτομα στο support απο μεγάλο σκηνικό, καλούμε το πολυ 1-2 άτομα από κάθε πλευρά, ειδικά αυτούς που έχουν clip δεν 
           δεχόμαστε 15-20 ατομα!

    `17`📜 Όποιος staff λύσει σκηνικό in game ή στο support και αποφασίσει ότι πρέπει να επιστραφούν πράγματα ή όπλα και δεν υπάρχει <@&888261526111268874> εκείνη 
            την στιγμή, είναι υποχρεωμένος να τα γράψει στο ανάλογο κανάλι. Όποιο staff αναλάβει να τα δώσει είναι υποχρεωμένος να αντιδράσει με κάποιο 
            react.

    `18`📜 Strike σε μαφίες θα μπορούν να δίνουν οι παρακάτω: <@&888261526111268874> <@&888261524987215893> <@&888261524710367272>. Εάν δεν ανήκετε στις συγκεκριμένες 
            κατηγορίες παρακαλώ αναζητήστε άμεσα έναν ανώτερο ώστε να λυθεί το συμβάν.

    `19`📜 Delete character, Kill character κάνουν μόνο από <@&888261526111268874>  και πάνω, αφού έχουν δει τις αναλογες αποδείξεις και υπάρχουν οι καταλληλες 
            προυποθέσεις. 

    `20`📜 Απαγορεύετε να δώσετε πράγματα σε κάποια criminal ομάδα (που έχασαν απο το armory) εάν δεν μιλήσετε με κάποιον <@&888261523951190017> και πάνω.

    `21`🆘 Η παράβαση κάποιων από τα παραπάνω rules θα τιμωρείται με warning από κάποιον <@&888261524987215893> και πάνω. Στα τρία warnings θα απομακρίνεστε από 
           το staff team.

    `22`🆘 Ανά πάσα ώρα και στιγμή μπορεί να απομακρυνθείτε από το Staff Team ακόμα και χωρίς προειδοποίηση.
    
    
    
    
    
    
    
    
    
    
    
    """
    embed = discord.Embed(title='***ΕΙΣΤΕ ΥΠΟΧΡΕΩΜΕΝΟΙ ΝΑ ΑΚΟΛΟΥΘΕΙΤΕ ΤΑ ΠΑΡΑΚΑΤΩ RULES *** ',description = desc, color=0x5F9EA0)
    await ctx.send(embed = embed)

#=================================================================================================================================================================
# DONATE
#=================================================================================================================================================================
@client.command()
@commands.has_permissions(manage_channels=True)
async def terms(ctx):
    embed = discord.Embed(color=0x4682B4)
    embed.add_field(name="```Terms & Conditions                                             ```", value="Όταν κάνετε ένα donate μας βοηθάτε να κρατάμε τον server ανοιχτό και να μπορούμε συνεχώς να τον αναβαθμίζουμε, σε καμία περίπτωση όμως ένας donator δεν θα έχει διαφορετική αντιμετώπιση από κάποιον που δεν έχει κάνει donate. Το donate στα Ελληνικά σημαίνει δωρεά και δεν είναι κάτι που σας αναγκάζουμε να κάνετε για να παίξετε στον server, για να παίξεις στον server δεν χρειάζεται να κάνετε donate. Εάν κάνεις κάποιο donate δεν θα υπάρξει για ευνόητους λόγους περίπτωση αντικατάστασης του πακέτου! Όλα τα donates θα παραμείνουν στον server μέχρι το wipe, δεν έχετε την δυνατότητα να τα πάρετε πίσω μετά το wipe ή άμα τιμωρηθείτε με ban. Τα donates δεν επιστρέφονται σε καμία περίπτωση όπως και επίσης δεν μπορόυν να δοθούν από κάποιον donator σε κάποιον παίκτη είτε με in game λεφτά είτε με κανονικά λεφτά. Τέλος, όποιο job δεν είναι ενεργό για δεκα (10) ημέρες θα κατάσχετε.", inline=False)
    embed.add_field(name="```Payment Methods                                                ```",
                    value="Δεχόμαστε μόνο PayPal (Ευρώ) και Paysafe (Ελληνική), για να κάνετε κάποιο donate θα πρέπει να μπείτε στο κανάλι <#888241205232697404> θα πρέπει να περιμένετε μέχρι να μπεί κάποιος αρμόδιος για να μιλήσετε.", inline=False)
    await ctx.send(embed=embed)


@client.command()
@commands.has_permissions(manage_channels=True)
async def don1(ctx):
    
    
    desc ="""
    Bronze Donator `10€`

    > 1 Donate Car
    """
    embed = discord.Embed(description = desc, color=0x99411d)
    await ctx.send(embed = embed)
    
    
    
    desc ="""
    Silver Donator `15€`
    
    > 2 Donate Car
    """
    embed = discord.Embed(description = desc, color = 0xc1c4d1)
    await ctx.send(embed = embed)
    
    
    
    
    
    desc ="""
    Gold Donator `20€`

    > 2 Donate Cars
    > 1 σπίτι
    """
    embed = discord.Embed(description = desc, color = 0xffd900)
    await ctx.send(embed = embed)
    
    
    
    
    
    desc ="""
    Platinum Donator `30€`

    > 3 Donate Car
    > 2 σπίτια
    """
    embed = discord.Embed(description = desc, color = 0x00f7ff)
    await ctx.send(embed = embed)
    
    
    desc ="""
    Diamond Donator `50€`

    > 3 Donate Car
    > 1 ελικόπτερο
    > 1 βάρκα
    > 2 σπίτια
    """
    embed = discord.Embed(description = desc, color = 0x00ffef)
    await ctx.send(embed = embed)
    
    


    desc ="""
    Priority

    > Bronze Priority ( 1 μήνας ) `5€`

    > Silver Priority ( 3 μήνες ) `10€`

    > Gold Priority ( Lifetime ) `20€`
    
    
    
    
    
    
    
    """
    embed = discord.Embed(description = desc, color = 0x2457F7)
    await ctx.send(embed = embed)



    desc ="""
    Extra 
    
    > 1 σπίτι `10€`

    > Bάρκα `15€`

    > Eλικόπτερο `15€`

    > Aεροπλάνο `20€`
    """
    embed = discord.Embed(description = desc, color = 0x1BC599)
    await ctx.send(embed = embed)
            

    desc ="""
    
    ```             Emerald Donator           ```
    ```                 Jobs                ```
    ```                Φαγάδικα                   ```
    <:green_cube:908011900703494184> KFC `50€`
    <:green_cube:908011900703494184> Pearl (Δυνατοτητα Custom) `40€ (60€)`
    <:green_cube:908011900703494184> ~~Goodys `40€`~~
    <:green_cube:908011900703494184> Mc Donalds `40€`
    <:green_cube:908011900703494184> Nοοdle Bar`40€`  
    <:green_cube:908011900703494184> Μικέλ `40€`
    <:green_cube:908011900703494184> Γρηγόρης `50€`
    <:green_cube:908011900703494184> Κινέζικο `40€`

    ```                 Συνεργεία                 ```
    <:green_cube:908011900703494184> ~~Βennys `40€`~~ 
    <:green_cube:908011900703494184> ~~Ghostdrivers `40€`~~
    <:green_cube:908011900703494184> Hoonigan `40€` 
    <:green_cube:908011900703494184> GrooveStreet `40€`
    <:green_cube:908011900703494184> Lscustoms `60€`
    <:green_cube:908011900703494184> SOA(CUSTOMS-MAFIA) `80€`
    
    ```                   Clubs                  ```
    <:green_cube:908011900703494184> Μαυρα Μεσάνυχτα `50€`
    <:green_cube:908011900703494184> Beach Bar `50€`
    <:green_cube:908011900703494184> Galaxy `50€`
    <:green_cube:908011900703494184> Heaven `50€`
    <:green_cube:908011900703494184> Unicorn `50€`
    

    ```               Other Jobs                ```
    <:green_cube:908011900703494184> Weed Shop `40€`
    <:green_cube:908011900703494184> Gun-Vest Shop`50€`
    <:green_cube:908011900703494184> Car Dealer `60€`
    <:green_cube:908011900703494184> Φαρμακείο `40€`


    """
    embed = discord.Embed(description = desc, color = 0x2ae636)
    await ctx.send(embed = embed)


    desc ="""
    ```Act Roleplay Gang Donator 30€```                                                                                                                                                                                                 
    
    > 1 Gang

    > 1 αμάξι για το gang 
        
    > 1 custom σπίτι για το Gang


    ```Act Roleplay Mafia Donator 50€```   

    > 1 Mαφία
    
    > 1 αμάξι για τη μαφία
    
    > 1 ελικόπτερο

    > 1 custom σπίτι για τη Μαφία


    ```Act Roleplay Cartel Donator 60€```  

    > 1 Cartel

    > 1 αμάξι για το Cartel
    
    > 1 ελικόπτερο

    > 1 custom σπίτι για το Cartel
    
    ```Extra: Επιχειρηση βιτρινα + 30€```  


    """
    embed = discord.Embed(description = desc, color = 0xff0000)
    await ctx.send(embed = embed)





#=================================================================================================================================================================
#Invite Command
#=================================================================================================================================================================
@client.command()
async def invites(ctx):
    totalInvites = 0
    for i in await ctx.guild.invites():
        if i.inviter == ctx.author:
            totalInvites += i.uses
    await ctx.send(ctx.author.mention + f"```You have {totalInvites} Invites{'' if totalInvites == 1 else ''} !```")


# welcome bye message + role 
#=================================================================================================================================================================
@client.event
async def on_member_join(member):
    channel = client.get_channel(888204597800353875)
    embed = discord.Embed(
        title="Welcome", description=f"{member.mention} Joined The server", color=0x3AFF00)
    await channel.send(embed=embed)

    role = get(member.guild.roles, id =(888264307719143444))
    await member.add_roles(role)
 
    count_channel = client.get_channel(967957702145867856)
    await asyncio.sleep(5)
    await count_channel.edit(name = 'Members: {}'.format(count_channel.guild.member_count))









@client.event
async def on_member_remove(member):
    channel = client.get_channel(888204597800353875)
    embed = discord.Embed(title="Goodbye", description=f"{member.mention} Just Left The Server", color=0xDC143C)
    await channel.send(embed=embed)


    count_channel = client.get_channel(967957702145867856)
    await asyncio.sleep(5)
    await count_channel.edit(name = 'Members: {}'.format(count_channel.guild.member_count))






    # end







#=================================================================================================================================================================
# DARK CHAT - REPORT - APPLICATION
#=================================================================================================================================================================

@client.event
async def on_message(message):
    if int(message.channel.id) == 888209555782242304:
        if message.author.bot:
            return
        content = message.content
        await message.delete()
        channel = client.get_channel(888209555782242304)
        channel2 = client.get_channel(896740232320401450)
        embed = discord.Embed(
            timestamp=datetime.datetime.utcnow(),
            description=(content), color=0x000000)
        embed.set_author(name='Dark Chat', icon_url="https://cdn.discordapp.com/attachments/898501740645728296/900825616679575552/download.png")
        if len(message.attachments) > 0:
            embed.set_image(url = message.attachments[0].url)
        await channel.send(embed=embed)
        embed.set_author(name=message.author,icon_url=message.author.avatar_url)
        await channel2.send(embed=embed)
    
    
    #=================================================================================================================================================================
    if message.author.bot:
        return

    else:
        await client.process_commands(message)
        id = client.get_channel(888210518999961642)
        channel2 = client.get_channel(891777701373956157)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Staff Application σου στάλθηκε επιτυχώς !")
            await channel2.send('=============================================================')
            await channel2.send(f"<@&888261524710367272> Ο {message.author.mention} Εκανε Staff Application Το παρακατω κείμενο ")
            await channel2.send(message.content)
            await channel2.send('=============================================================')
    #=================================================================================================================================================================

    if message.author.bot:
        return
    else:
        id = client.get_channel(888209932309102632)
        channel2 = client.get_channel(889196870243598367)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Staff Report σου στάλθηκε επιτυχώς !")
            await channel2.send('=============================================================')
            await channel2.send(f"<@&888261524710367272> O {message.author.mention} έκανε Staff Report τον παρακάτω Staff : ")
            await channel2.send(message.content)
            await channel2.send('=============================================================')
    #=================================================================================================================================================================


    if message.author.bot:
        return
    else:
        id = client.get_channel(888209951925862430)
        channel2 = client.get_channel(897530923652907080)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Player Report σου στάλθηκε!")
            await channel2.send('=============================================================')
            await channel2.send(f"<@&891318691071942736> O {message.author.mention} έκανε Player Report τον παρακάτω Player:")
            await channel2.send(message.content)
            await channel2.send('=============================================================')

    #=================================================================================================================================================================
    if message.author.bot:
        return
    else:
        id = client.get_channel(888209995018166272)
        channel2 = client.get_channel(897531262254874624)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Bug Report σου στάλθηκε επιτυχώς! Σύντομα ένας <@&888263983306514472> θα το δεί")
            embed = discord.Embed(
                timestamp=datetime.datetime.utcnow(), color=0x0170AB)
            embed.add_field(name='New Bug Report 👨‍🔧',
                            value=f'<@&888263983306514472> O {message.author.mention} έκανε Bug Report το παρακάτω Bug:', inline=False)
            embed.add_field(name=message.content, value='|| ||', inline=False)
            embed.set_author(name='Εικόνα Του user',
                             icon_url=message.author.avatar_url)
            await channel2.send(embed=embed)
    #=================================================================================================================================================================
    if message.author.bot:
        return
    else:
        id = client.get_channel(888210026597068840)
        channel2 = client.get_channel(889027036578992128)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Vehicle Bug σου στάλθηκε σύντομα ένας <@&896328646350999572> Dev Θα το δεί")
            embed = discord.Embed(
                timestamp=datetime.datetime.utcnow(), color=0x0170AB)
            embed.add_field(name='New Vehicle Bug 🚗',
                            value=f'<@&896328646350999572> O {message.author.mention} έκανε το παρακάτω Vehicle Bug :', inline=False)
            embed.add_field(name=message.content, value='|| ||', inline=False)
            embed.set_author(name='Εικόνα Του user',
                             icon_url=message.author.avatar_url)
            await channel2.send(embed=embed)
    #=================================================================================================================================================================
    if message.author.bot:
        return
    else:
        id = client.get_channel(888209977779576843)
        channel2 = client.get_channel(897572031074271322)
        if message.channel == id:
            await message.delete()
            await message.channel.send(f"{message.author.mention} Το Ban Appeal σου στάλθηκε με επιτυχία !")
            embed = discord.Embed(
                timestamp=datetime.datetime.utcnow(), color=0x0170AB)
            embed.add_field(name='New Ban Appeal 💥',
                            value=f'<@&891318691071942736> O {message.author.mention} έκανε Ban Appeal το παρακάτω Ban:', inline=False)
            embed.add_field(name=message.content, value='|| ||', inline=False)
            embed.set_author(name='Εικόνα Του user',
                             icon_url=message.author.avatar_url)

            await channel2.send(embed=embed)
    #=================================================================================================================================================================
    # SUGGESTION
    #=================================================================================================================================================================
    if (message.channel.id) == 888209640750448681:

        await message.add_reaction('✅')
        await message.add_reaction('❌')

    if (message.channel.id) == 888209676863430656:

        await message.add_reaction('✅')
        await message.add_reaction('❌')
    #=================================================================================================================================================================
    # ANTI LINK
    #================================================================================================================================================================= 




    if 'https://' in message.content.lower():
        if(message.channel.name.startswith("🎬clips")):
            print("")
        else:
            if message.author.guild_permissions.manage_messages:
                print('')
            else:
                await message.delete()
                await message.channel.send(f"{message.author.mention} Απογορέυοντε τα Links Εχεις Mute!")
                role = message.guild.get_role(888641903673872415)
                await message.author.add_roles(role)








    guild = message.guild
    log_channel = discord.utils.get(guild.channels, name="send-message-log")
    if log_channel is None:
        await client.process_commands(message)
        return
    if not message.author.bot:
        embed=discord.Embed(
            timestamp=datetime.datetime.utcnow(),
            description="`Send in` {}:\n{}".format(message.channel.mention,message.content)
        )
        embed.set_author(name=message.author, icon_url=message.author.avatar_url)
        if len(message.attachments) > 0:
            embed.set_image(url = message.attachments[0].url)
        await log_channel.send(embed=embed)
        \







@client.listen("on_voice_state_update")
async def on_voice_state_update(member, before, after):

    channel = client.get_channel(988924808723054623)

    if after.channel and after.channel.id == 888240859202596904:
        voicec = await after.channel.clone(name='Support - '+member.name)
        guild = member.guild

        await voicec.set_permissions(member, send_messages=True, read_messages=True, add_reactions=True, embed_links=True, attach_files=True, read_message_history=True, external_emojis=True)

        await voicec.set_permissions(guild.get_role(guild.id), send_messages=False, read_messages=False)
        await member.move_to(voicec)
        await channel.send(f'Ο/Η χρήστης {member.mention} Μπήκε στο κανάλι {voicec.name}\n ||<@&891318691071942736> <@&896393174392643584>||')

    if str("Support - ") in before.channel.name:
        if len(before.channel.members) == 0:
            await before.channel.delete()


    if after.channel is None and before.channel.name == ('Support - '):
        voicechch = discord.utils.get(member.guild.voice_channels, ('Support - '))
        if len(voicechch.members) == 0:
            await voicechch.delete()







@client.listen("on_voice_state_update")
async def on_voice_state_update(member, before, after):
    channel = client.get_channel(971231475762626590)

    if after.channel and after.channel.id == 961657986881822740:
        voicec = await after.channel.clone(name='Whitelist - '+member.name)
        guild = member.guild

        await voicec.set_permissions(member, send_messages=True, read_messages=True, add_reactions=True, embed_links=True, attach_files=True, read_message_history=True, external_emojis=True)

        await voicec.set_permissions(guild.get_role(guild.id), send_messages=False, read_messages=False)
        await member.move_to(voicec)
        await channel.send(f'<@&961657173551747174>, Ο/Η χρήστης {member.mention} Μπήκε στο κανάλι {voicec.name} ')
    if str("Whitelist -") in before.channel.name:
        if len(before.channel.members) == 0:
            await before.channel.delete()


    if after.channel is None and before.channel.name == ('Whitelist -'):
        voicechch = discord.utils.get(member.guild.voice_channels, ('Whitelist -'))
        if len(voicechch.members) == 0:
            await voicechch.delete()


@client.listen("on_voice_state_update")
async def on_voice_state_update(member, before, after):
    channel = client.get_channel(971234631741472798)

    if after.channel and after.channel.id == 888241205232697404:
        voicec = await after.channel.clone(name='Donate - '+member.name)
        guild = member.guild

        await voicec.set_permissions(member, send_messages=True, read_messages=True, add_reactions=True, embed_links=True, attach_files=True, read_message_history=True, external_emojis=True)

        await voicec.set_permissions(guild.get_role(guild.id), send_messages=False, read_messages=False)
        await member.move_to(voicec)
        await channel.send(f'<@&889007420251193374>, Ο/Η χρήστης {member.mention} Μπήκε στο κανάλι {voicec.name} ')
    if str("Donate -") in before.channel.name:
        if len(before.channel.members) == 0:
            await before.channel.delete()


    if after.channel is None and before.channel.name == ('Donate -'):
        voicechch = discord.utils.get(member.guild.voice_channels, ('Donate -'))
        if len(voicechch.members) == 0:
            await voicechch.delete()



member_list = []

@client.command()
@commands.has_permissions(manage_channels=True)
async def dm_all(ctx, *, args=None):
    
    if args != None:
        members = ctx.guild.members
        
        for member in members:
            
            try:
                if member.name in member_list:
                    print("'" + args + "'already sent to: " + member.name)
                   
                else:
                    await member.send(args)
                    print("'" + args + "' sent to: " + member.name)
                    


            except:
                print("Couldn't send '" + args + "' to " + member.name)

            member_list.append(member.name)


    else:
        await ctx.channel.send("You didn't provide message.")
   








































































#============================================================================|
client.run('***Bot Token Here***')
#============================================================================|

